---
kind: type
id: T:Autodesk.Revit.DB.FilterNumericEquals
source: html/13cab7f3-d15d-adfd-ff43-c69a4863a636.htm
---
# Autodesk.Revit.DB.FilterNumericEquals

Tests whether numeric values from the document are equal to a certain value

## Syntax (C#)
```csharp
public class FilterNumericEquals : FilterNumericRuleEvaluator
```